# Практикум по дисперсионному анализу

# Данные из файла tomato.csv
# - weight --- вес томатов в граммах
# - trt - фактор с уровнями "water only", "conc nutrient",
#   "2-4-D + conc nutrient", "3x conc nutrient"
# Постройте линейную модель, чтобы описать, как
# зависит вес томатов от условий выращивания.

# Разведочный анализ #############################


# Линейная модель ################################

# Задание для закрепления знаний о типах параметрицации --------------------
# Постройте линейную модель в параметризации индикаторных переменных
# и в параметризации эффектов.
# Посмотрите, чем отличаются их модельные матрицы.
# Вспомните, как кодируются коэффициенты и что они обозначают.
# Убедитесь в том, что не смотря на разные коэффициенты эти модели
# дают одинаковые предсказания (да, это так).


# В обычной жизни вам понадобится только одна из этих моделей.
# Вы уже убедились, что они эквивалентны.
# Выберите любую и продолжите анализ.



# Диагностика модели #############################


# Дисперсионный анализ ###########################


# Пост хок тест ##################################


# График модели ##################################
