# Практикум по дисперсионному анализу ----

# Данные из файла tomato.csv
# Данные эксперимента по сравнению эффективности
# влияния различных схем внесения удобрения на рост томатов.
# - weight --- вес томатов в граммах
# - trt - варианты экспериментальной обработки (treatment).
#         Фактор с уровнями:
#         "water only" (только вода, контроль),
#         "conc nutrient" (базовая концентрация удобрения),
#         "2-4-D + conc nutrient" (гербицид + удобрение),
#         "3x conc nutrient" (утроенная концентрация удобрения).
# Постройте линейную модель, чтобы описать, как
# зависит вес томатов от условий выращивания.

# 1) Разведочный анализ --------------------------


# 2) Линейная модель -----------------------------
# Задание для закрепления знаний о типах параметризации
# - Постройте линейную модель в параметризации индикаторных переменных
# и в параметризации эффектов.
# - Посмотрите, чем отличаются их модельные матрицы.
# - Вспомните, как кодируются коэффициенты и что они обозначают.
# - Убедитесь в том, что, несмотря на разные коэффициенты, эти модели
# дают одинаковые предсказания (да, это так).


# В обычной жизни вам понадобится только одна из этих моделей.
# Вы уже убедились, что они эквивалентны.
# Выберите любую и продолжите анализ.

# 3) Диагностика модели -----------------------------


# 4) Дисперсионный анализ ---------------------------


# 5) Пост хок тест ----------------------------------


# 6) График предсказаний модели ---------------------


