# Практикум по дисперсионному анализу
# Задание 1

# В датасете rice из пакета DAAG содержатся данные
# о росте риса (Perrine et al., 2001; Maindonald,
# Braun, 2015).
# Постройте линейную модель, чтобы описать, как
# зависит сухая масса побегов риса от сорта,
# удобрений и взаимодействия этих факторов.

library(DAAG)
data(rice)

# Разведочный анализ #############################


# Линейная модель ################################
# в параметризации индикаторных переменных


# Диагностика модели #############################


# Дисперсионный анализ ###########################


# Пост хок тест ##################################


# График модели ##################################
