# Практикум по дисперсионному анализу
# Задание 2

# В датасете SandwichAnts из пакета Stat2Data
# содержатся данные о привлекательности сендвичей
# с разной начинкой для муравьев (Mackisack, 1994;
# Lock, 2013).
# Постройте линейную модель, чтобы описать, как
# зависит число муравьев на сендвиче от типа
# хлеба, начинки, наличия масла и взаимодействия
# этих факторов.

library(Stat2Data)
data(SandwichAnts)


# Разведочный анализ #############################


# Линейная модель ################################
# в параметризации индикаторных переменных


# Диагностика модели #############################


# Дисперсионный анализ ###########################


# Пост хок тест ##################################


# График модели ##################################
