#' title       : "Коррекция гетерогенности дисперсий"
#' subtitle: "Линейные модели..."
#' author: "Марина Варфоломеева, Вадим Хайтов"



############## Самостоятельная работа################

## Пользуясь данными из датасета mussel_juv_ad.csv постройте модель, отражающую связь между обилием молодых мидий и обилем старых особей.






# Пользуясь данными из встроенного датасета Spruce (пакет nlme) постройте модель роста деревьев взависимости от времени


data("Spruce")

head(Spruce)






# Пользуясь данными из встроенного датасета RatPupWeight (пакет nlme) выясните зависит ли вес новорожденных крысят от экспериментального воздействия пола и количества детенышей в помете.

data(RatPupWeight)

head(RatPupWeight)





