---
layout: page
title: Критерии оценки домашних заданий
tagline: Линейные модели, дисперсионный и регрессионный анализ с использованием R
---

[Пример решения домашнего задания](example_task.zip).

Минимальный набор файлов в решенном домашнем задании --- код и отчет.

### Требования к коду

Код - это программа, выполнив которую, можно воспроизвести ваши результаты (с минимальной заменой путей к файлам с исходными данными). Внимание: код прикладывайте в виде отдельного файла .R, без вывода консоли!

- [Правила хорошего кода](pages/coding_practices.md)

### Требования к отчету

Каждый из пунктов анкеты оценивается так: 1/6 балла - да, все, что нужно; 1/12 балла - да, но не все, что нужно; 0 - нет, ничего.

Вдохновлено критериями оценки заданий от [Джеффа Лика](http://www.biostat.jhsph.edu/~jleek/research.html) в курсе Data Analysis на [Coursera](http:/coursera.org).

## Анкета, по которой оценивается домашнее задание

Оценка ХХ + ХХ = XX из 5 возможных баллов

### A. Самостоятельность выполнения задания.

1. Самостоятельно ли написан текст домашнего задания? В случае обнаружения явных заимствований или не оформленных цитат все баллы "сгорают"

### B. Описание анализа данных и результатов

1. Описаны ли в тексте вопросы, на которые нужно дать ответ или гипотезы, которые нужно проверить?
2. Описаны ли в тексте особенности применения статистических методов?
3. Содержит ли анализ ссылки на использованные статистические методы и программное обеспечение?
4. Упоминаются ли переменные простыми словами, а не кодовыми наименованиями?
5. Указаны ли в тексте объемы выборок?
6. Корректно ли применены статистические процедуры?
7. Правильно ли интерпретированы результаты анализа?
8. Сделаны ли конкретные выводы из анализа?
9. Есть ли в тексте пронумерованные ссылки на рисунки и таблицы?
10. Написан ли текст на хорошем русском языке?

### C. Рисунки, таблицы и подписи

1. Действительно ли рисунок/таблица содержит важную информацию для проведения анализа?
2. Достаточно ли подписи к рисунку/таблице, чтобы можно было понять его в отрыве от основного текста?
3. Подписаны ли на рисунке оси, достаточно ли велик шрифт, чтобы его было удобно читать?

### D. R-код

1. Можно ли воспроизвести анализ при помощи приложенного кода? 
